package query;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;
import java.util.Objects;

import org.codehaus.jackson.map.ObjectMapper;

public class Site {
	private static String json=
			        "["+
					"{\"pid\":\"hl\",\"pname\":\"黑龙江\",\"cs\":["+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"jl\",\"pname\":\"吉林\",\"cs\":["+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"ln\",\"pname\":\"辽宁\",\"cs\":["+
					"{\"cid\":\"210100000400\",\"cname\":\"沈阳车管所\"},"+
					"{\"cid\":\"210200000400\",\"cname\":\"大连市车管所\"},"+
					"{\"cid\":\"210300000400\",\"cname\":\"鞍山支队车辆管理所\"},"+
					"{\"cid\":\"210400000400\",\"cname\":\"抚顺市车辆管理所\"},"+
					"{\"cid\":\"210500000400\",\"cname\":\"本溪车辆管理所\"},"+
					"{\"cid\":\"210600000400\",\"cname\":\"丹东市交警支队车管所\"},"+
					"{\"cid\":\"210700000400\",\"cname\":\"锦州交警支队车管所\"},"+
					"{\"cid\":\"210800000400\",\"cname\":\"营口市级车管所\"},"+
					"{\"cid\":\"210900000400\",\"cname\":\"阜新交警支队车管所\"},"+
					"{\"cid\":\"211000000400\",\"cname\":\"辽阳市公安局车辆管理所\"},"+
					"{\"cid\":\"211100000400\",\"cname\":\"盘锦交警支队车管所\"},"+
					"{\"cid\":\"211200000400\",\"cname\":\"铁岭交警支队车管所\"},"+
					"{\"cid\":\"211300000400\",\"cname\":\"朝阳市交通警察支队车管所\"},"+
					"{\"cid\":\"211400000400\",\"cname\":\"葫芦岛交警支队车管所\"}"+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"he\",\"pname\":\"河北\",\"cs\":["+
					"{\"cid\":\"130100000400\",\"cname\":\"石家庄市公安局交通管理局车管所\"},"+
					"{\"cid\":\"130200000400\",\"cname\":\"唐山交警支队车管所\"},"+
					"{\"cid\":\"130300000400\",\"cname\":\"秦皇岛市车管所\"},"+
					"{\"cid\":\"130400000400\",\"cname\":\"邯郸市车管所\"},"+
					"{\"cid\":\"130500000400\",\"cname\":\"邢台市车管所\"},"+
					"{\"cid\":\"130600000400\",\"cname\":\"保定市车管所\"},"+
					"{\"cid\":\"130700000400\",\"cname\":\"张家口市车管所\"},"+
					"{\"cid\":\"130800000400\",\"cname\":\"承德市车管所\"},"+
					"{\"cid\":\"130900000400\",\"cname\":\"沧州市车管所\"},"+
					"{\"cid\":\"131000000400\",\"cname\":\"廊坊市车辆管理所\"},"+
					"{\"cid\":\"131100000400\",\"cname\":\"衡水市交警支队车管所\"}"+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"tj\",\"pname\":\"天津\",\"cs\":["+
					"{\"cid\":\"120000000400\",\"cname\":\"车管所市所\"}"+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"bj\",\"pname\":\"北京\",\"cs\":["+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"sd\",\"pname\":\"山东\",\"cs\":["+
					"{\"cid\":\"370100000400\",\"cname\":\"济南市车管所\"},"+
					"{\"cid\":\"370200000400\",\"cname\":\"青岛市车辆管理所\"},"+
					"{\"cid\":\"370300000400\",\"cname\":\"淄博市车辆管理所\"},"+
					"{\"cid\":\"370400000400\",\"cname\":\"枣庄支队车管所\"},"+
					"{\"cid\":\"370500000400\",\"cname\":\"东营市车管所\"},"+
					"{\"cid\":\"370800000400\",\"cname\":\"济宁交警支队车管所\"},"+
					"{\"cid\":\"370900000400\",\"cname\":\"泰安车管所\"},"+
					"{\"cid\":\"371000000400\",\"cname\":\"威海车管所\"},"+
					"{\"cid\":\"371100000400\",\"cname\":\"日照支队车管所\"},"+
					"{\"cid\":\"371300000400\",\"cname\":\"临沂市交警支队车管所\"},"+
					"{\"cid\":\"371500000400\",\"cname\":\"聊城市车辆管理所\"},"+
					"{\"cid\":\"371700000400\",\"cname\":\"菏泽车辆管理所\"}"+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"sx\",\"pname\":\"山西\",\"cs\":["+
					"{\"cid\":\"140200000400 大同市车管所\"},"+
					"{\"cid\":\"140600000400\",\"cname\":\"朔州市车管处\"},"+
					"{\"cid\":\"140700000400\",\"cname\":\"晋中交警支队车辆管理所\"}"+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"ha\",\"pname\":\"河南\",\"cs\":["+
					"{\"cid\":\"410100000400\",\"cname\":\"郑州市交警支队车辆管理所\"},"+
					"{\"cid\":\"410200000400\",\"cname\":\"开封市交警支队车辆管理所\"},"+
					"{\"cid\":\"410300000400\",\"cname\":\"洛阳交警支队车辆驾驶人管理所\"},"+
					"{\"cid\":\"410400000400\",\"cname\":\"平顶山市交警支队车辆管理所\"},"+
					"{\"cid\":\"410500000400\",\"cname\":\"河南省安阳市交警支队车管所\"},"+
					"{\"cid\":\"410600000400\",\"cname\":\"鹤壁市公安局支队车辆管理所\"},"+
					"{\"cid\":\"410700000400\",\"cname\":\"新乡市公安局交通管理支队车管所\"},"+
					"{\"cid\":\"410800000400\",\"cname\":\"焦作交警支队车管所\"},"+
					"{\"cid\":\"410900000400\",\"cname\":\"濮阳市车管所\"},"+
					"{\"cid\":\"411000000400\",\"cname\":\"许昌市交警支队车（驾）管所\"},"+
					"{\"cid\":\"411100000400\",\"cname\":\"漯河市车辆管理所\"},"+
					"{\"cid\":\"411200000400\",\"cname\":\"三门峡市车辆管理所\"},"+
					"{\"cid\":\"411300000400\",\"cname\":\"南阳市交管支队车驾管大队\"},"+
					"{\"cid\":\"411400000400\",\"cname\":\"商丘车辆管理所\"},"+
					"{\"cid\":\"411500000400\",\"cname\":\"信阳市车辆管理所\"},"+
					"{\"cid\":\"411600000400\",\"cname\":\"周口支队车辆管理所\"},"+
					"{\"cid\":\"411700000400\",\"cname\":\"驻马店市交警支队车管所\"},"+
					"{\"cid\":\"418800000400\",\"cname\":\"济源市交通管理支队车管所\"}"+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"ah\",\"pname\":\"安徽\",\"cs\":["+
					"{\"cid\":\"340100000400\",\"cname\":\"安徽省合肥交警支队机动车辆管理所\"},"+
					"{\"cid\":\"340200000400\",\"cname\":\"芜湖交警支队车管所\"},"+
					"{\"cid\":\"340300000400\",\"cname\":\"蚌埠市公安局交通警察支队车辆管理所\"},"+
					"{\"cid\":\"340400000400\",\"cname\":\"淮南市交警支队车管所\"},"+
					"{\"cid\":\"340500000400\",\"cname\":\"马鞍山市车辆管理所\"},"+
					"{\"cid\":\"340600000400\",\"cname\":\"淮北市交通警察支队车管所\"},"+
					"{\"cid\":\"340700000400\",\"cname\":\"铜陵市公安局交警支队车管所\"},"+
					"{\"cid\":\"341000000400\",\"cname\":\"黄山支队车管所\"},"+
					"{\"cid\":\"341100000400\",\"cname\":\"安徽省滁州市车管所\"},"+
					"{\"cid\":\"341200000400\",\"cname\":\"阜阳支队车管所\"},"+
					"{\"cid\":\"341300000400\",\"cname\":\"宿州支队车管所\"},"+
					"{\"cid\":\"341500000400\",\"cname\":\"安徽省六安市公安局交警支队车管所\"},"+
					"{\"cid\":\"341600000400\",\"cname\":\"亳州市车管所\"},"+
					"{\"cid\":\"341700000400\",\"cname\":\"池州交警支队车管所\"},"+
					"{\"cid\":\"341800000400\",\"cname\":\"宣城支队车管所\"}"+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"hb\",\"pname\":\"湖北\",\"cs\":["+
					"{\"cid\":\"420100000400\",\"cname\":\"武汉市交管局车辆管理处\"},"+
					"{\"cid\":\"420500000400\",\"cname\":\"宜昌交警车管所\"}"+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"jx\",\"pname\":\"江西\",\"cs\":["+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"fj\",\"pname\":\"福建\",\"cs\":["+
					"{\"cid\":\"350100000400\",\"cname\":\"福州市公安局交通警察支队车辆管理所\"},"+
					"{\"cid\":\"350200000400\",\"cname\":\"厦门市公安局交通警察支队车管所\"},"+
					"{\"cid\":\"350300000400\",\"cname\":\"莆田市公安局交警支队车辆管理所\"},"+
					"{\"cid\":\"350400000400\",\"cname\":\"三明市公安局交通警察支队车管所\"},"+
					"{\"cid\":\"350500000400\",\"cname\":\"泉州市公安局交通警察支队车辆管理所\"},"+
					"{\"cid\":\"350600000400\",\"cname\":\"漳州市公安局交通警察支队车管所\"},"+
					"{\"cid\":\"350700000400\",\"cname\":\"南平市公安局交警支队车管所\"},"+
					"{\"cid\":\"350800000400\",\"cname\":\"龙岩市公安局交通警察支队车辆与驾驶人管理大队\"},"+
					"{\"cid\":\"350900000400\",\"cname\":\"宁德市公安局交警支队车辆管理所\"}"+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"hn\",\"pname\":\"湖南\",\"cs\":["+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"gd\",\"pname\":\"广东\",\"cs\":["+
					"{\"cid\":\"440100000400\",\"cname\":\"广州市交警支队车辆管理所\"},"+
					"{\"cid\":\"440200000400\",\"cname\":\"韶关市交警支队车管所\"},"+
					"{\"cid\":\"440300000400\",\"cname\":\"深圳市交警支队车辆管理所\"},"+
					"{\"cid\":\"440400000400\",\"cname\":\"珠海市车辆管理所\"},"+
					"{\"cid\":\"440500000400\",\"cname\":\"汕头市交警支队车管所\"},"+
					"{\"cid\":\"440600000400\",\"cname\":\"佛山市交警支队车管所\"},"+
					"{\"cid\":\"440700000400\",\"cname\":\"江门车管所\"},"+
					"{\"cid\":\"440800000400\",\"cname\":\"湛江市交警支队车管所\"},"+
					"{\"cid\":\"440900000400\",\"cname\":\"茂名车管所\"},"+
					"{\"cid\":\"441200000400\",\"cname\":\"肇庆市交警支队车管所\"},"+
					"{\"cid\":\"441300000400\",\"cname\":\"惠州交警支队车管所\"},"+
					"{\"cid\":\"441400000400\",\"cname\":\"梅州市公安局交警支队车辆管理所\"},"+
					"{\"cid\":\"441500000400\",\"cname\":\"汕尾市公安局交警支队车辆管理所\"},"+
					"{\"cid\":\"441600000400\",\"cname\":\"河源市交警支队车辆管理所\"},"+
					"{\"cid\":\"441700000400\",\"cname\":\"阳江市支队车辆管理所\"},"+
					"{\"cid\":\"441800000400\",\"cname\":\"清远市交警支队车管所\"},"+
					"{\"cid\":\"441900000400\",\"cname\":\"东莞市交警支队车辆管理所\"},"+
					"{\"cid\":\"442000000400\",\"cname\":\"中山市交警支队车管所\"},"+
					"{\"cid\":\"445100000400\",\"cname\":\"潮州市车辆管理所\"},"+
					"{\"cid\":\"445200000400\",\"cname\":\"揭阳市车辆管理所\"},"+
					"{\"cid\":\"445300000400\",\"cname\":\"云浮交警支队车管所\"},"+
					"{\"cid\":\"449001000400\",\"cname\":\"顺德交警大队车管所\"},"+
					"{\"cid\":\"449002000400\",\"cname\":\"南海大队车辆管理所\"}"+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"gx\",\"pname\":\"广西\",\"cs\":["+
					"{\"cid\":\"450100000400\",\"cname\":\"南宁市支队车辆管理所\"},"+
					"{\"cid\":\"450200000400\",\"cname\":\"柳州市车辆管理所\"},"+
					"{\"cid\":\"450400000400\",\"cname\":\"车辆管理所\"},"+
					"{\"cid\":\"450500000400\",\"cname\":\"北海市公安局交警支队车辆管理所\"},"+
					"{\"cid\":\"450700000400\",\"cname\":\"钦州市公安局交通警察支队车管所\"},"+
					"{\"cid\":\"451000000400\",\"cname\":\"百色支队车管所\"},"+
					"{\"cid\":\"451200000400\",\"cname\":\"河池支队车管所\"}"+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"gz\",\"pname\":\"贵州\",\"cs\":["+
					"{\"cid\":\"520100000400\",\"cname\":\"贵阳市三桥车管\"},"+
					"{\"cid\":\"520200000400\",\"cname\":\"六盘水市支队车辆管理所\"},"+
					"{\"cid\":\"520300000400\",\"cname\":\"遵义市交警支队车辆管理所\"},"+
					"{\"cid\":\"520400000400\",\"cname\":\"安顺市支队车辆管理所\"},"+
					"{\"cid\":\"522200000400\",\"cname\":\"铜仁市支队车辆管理所\"},"+
					"{\"cid\":\"522300000400\",\"cname\":\"黔西南州支队车辆管理所\"},"+
					"{\"cid\":\"522400000400\",\"cname\":\"毕节市交警支队车辆管理所\"},"+
					"{\"cid\":\"522600000400\",\"cname\":\"黔东南州支队车辆管理所\"},"+
					"{\"cid\":\"522700000400\",\"cname\":\"黔南州交警支队车管所\"}"+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"cq\",\"pname\":\"重庆\",\"cs\":["+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"sn\",\"pname\":\"陕西\",\"cs\":["+
					"{\"cid\":\"610100000400\",\"cname\":\"西安支队车辆管理处（市车管所）\"},"+
					"{\"cid\":\"610200000400\",\"cname\":\"铜川市公安局交通警察支队车辆管理所\"},"+
					"{\"cid\":\"610300000400\",\"cname\":\"宝鸡交警支队车管所\"},"+
					"{\"cid\":\"610400000400\",\"cname\":\"咸阳车管所\"},"+
					"{\"cid\":\"610500000400\",\"cname\":\"渭南支队车管处\"},"+
					"{\"cid\":\"610700000400\",\"cname\":\"汉中支队车辆管理所\"},"+
					"{\"cid\":\"610800000400\",\"cname\":\"榆林交警支队车辆管理所\"},"+
					"{\"cid\":\"610900000400\",\"cname\":\"安康交警支队车管所\"},"+
					"{\"cid\":\"611000000400\",\"cname\":\"商洛市交警支队车管所\"},"+
					"{\"cid\":\"611400000400\",\"cname\":\"陕西省杨凌车管所\"}"+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"nm\",\"pname\":\"内蒙古\",\"cs\":["+
					"{\"cid\":\"150100000400\",\"cname\":\"呼市交管支队车管所\"},"+
					"{\"cid\":\"150200000400\",\"cname\":\"包头市交管支队车管所\"},"+
					"{\"cid\":\"150300000400\",\"cname\":\"乌海车管所\"},"+
					"{\"cid\":\"150400000400\",\"cname\":\"赤峰市车管所\"},"+
					"{\"cid\":\"150500000400\",\"cname\":\"通辽车辆管理所\"},"+
					"{\"cid\":\"150600000400\",\"cname\":\"鄂尔多斯车管所\"},"+
					"{\"cid\":\"150700000400\",\"cname\":\"呼伦贝尔车管所\"},"+
					"{\"cid\":\"150800000400\",\"cname\":\"巴彦淖尔车管所\"},"+
					"{\"cid\":\"150900000400\",\"cname\":\"乌兰察布车辆管理所\"},"+
					"{\"cid\":\"152200000400\",\"cname\":\"兴安盟车辆管理所\"},"+
					"{\"cid\":\"152500000400\",\"cname\":\"锡林郭勒盟交管支队车管所\"},"+
					"{\"cid\":\"152900000400\",\"cname\":\"阿盟车辆和驾驶人管理所\"}"+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"nx\",\"pname\":\"宁夏\",\"cs\":["+
					"{\"cid\":\"640100000400\",\"cname\":\"银川市车管所\"},"+
					"{\"cid\":\"640200000400\",\"cname\":\"石嘴山市车辆管理所\"},"+
					"{\"cid\":\"640300000400\",\"cname\":\"吴忠交警支队车管所\"},"+
					"{\"cid\":\"640400000400\",\"cname\":\"固原市车辆管理所\"},"+
					"{\"cid\":\"640500000400\",\"cname\":\"中卫市车管所\"}"+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"sc\",\"pname\":\"四川\",\"cs\":["+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"yn\",\"pname\":\"云南\",\"cs\":["+
					"{\"cid\":\"530100000400\",\"cname\":\"昆明支队车辆管理所\"},"+
					"{\"cid\":\"530300000400\",\"cname\":\"曲靖支队车管所\"},"+
					"{\"cid\":\"530400000400\",\"cname\":\"玉溪车管所\"},"+
					"{\"cid\":\"530500000400\",\"cname\":\"保山支队车辆管理所\"},"+
					"{\"cid\":\"530600000400\",\"cname\":\"昭通支队车管所\"},"+
					"{\"cid\":\"530700000400\",\"cname\":\"丽江市交警支队车辆管理所\"},"+
					"{\"cid\":\"530800000400\",\"cname\":\"普洱支队车辆管理所\"},"+
					"{\"cid\":\"530900000400\",\"cname\":\"临沧交警支队车管所\"},"+
					"{\"cid\":\"532300000400\",\"cname\":\"楚雄交警支队车管所\"},"+
					"{\"cid\":\"532500000400\",\"cname\":\"红河州交警支队车管所\"},"+
					"{\"cid\":\"532600000400\",\"cname\":\"文山支队车管所\"},"+
					"{\"cid\":\"532800000400\",\"cname\":\"版纳支队车管所\"},"+
					"{\"cid\":\"532900000400\",\"cname\":\"大理支队车辆管理所\"},"+
					"{\"cid\":\"533100000400\",\"cname\":\"德宏车辆管理所\"},"+
					"{\"cid\":\"533300000400\",\"cname\":\"怒江支队车辆管理所\"},"+
					"{\"cid\":\"533400000400\",\"cname\":\"迪庆交警支队车管所\"}"+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"gs\",\"pname\":\"甘肃\",\"cs\":["+
					"{\"cid\":\"620100000400\",\"cname\":\"兰州支队车辆管理所\"},"+
					"{\"cid\":\"620200000400\",\"cname\":\"嘉峪关支队车管所\"},"+
					"{\"cid\":\"620300000400\",\"cname\":\"金昌支队车辆管理所\"},"+
					"{\"cid\":\"620400000400\",\"cname\":\"白银支队车管所\"},"+
					"{\"cid\":\"620500000400\",\"cname\":\"天水支队车管所\"},"+
					"{\"cid\":\"622100000400\",\"cname\":\"酒泉支队车管所\"},"+
					"{\"cid\":\"622200000400\",\"cname\":\"张掖支队车管所\"},"+
					"{\"cid\":\"622300000400\",\"cname\":\"武威支队车管所\"},"+
					"{\"cid\":\"622400000400\",\"cname\":\"定西支队车管所\"},"+
					"{\"cid\":\"622600000400\",\"cname\":\"陇南市交警支队车管所\"},"+
					"{\"cid\":\"622700000400\",\"cname\":\"平凉支队车管所\"},"+
					"{\"cid\":\"622800000400\",\"cname\":\"庆阳支队车辆管理所\"},"+
					"{\"cid\":\"622900000400\",\"cname\":\"临夏支队车管所\"},"+
					"{\"cid\":\"623000000400\",\"cname\":\"甘南支队车辆管理所\"}"+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"qh\",\"pname\":\"青海\",\"cs\":["+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"xz\",\"pname\":\"西藏\",\"cs\":["+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"xj\",\"pname\":\"新疆\",\"cs\":["+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"hi\",\"pname\":\"海南\",\"cs\":["+
					"{\"cid\":\"460100000400\",\"cname\":\"海口车管所\"},"+
					"{\"cid\":\"460200000400\",\"cname\":\"三亚车管所\"},"+
					"{\"cid\":\"460300000400\",\"cname\":\"洋浦车管所\"},"+
					"{\"cid\":\"469080000400\",\"cname\":\"琼南车管所\"},"+
					"{\"cid\":\"469090000400\",\"cname\":\"琼北车管所\"}"+
					"]},"+
					""+
					""+
					""+
					"{\"pid\":\"sh\",\"pname\":\"上海\",\"cs\":["+
					"]}"+
					"]";



	public static List<Map<String,Object>> getAll(){
		List<Map<String,Object>> site=new ArrayList<Map<String,Object>>();
		try {
			site=new ObjectMapper().readValue(json, List.class);
		} catch (Exception e) {
			e.printStackTrace();
		}
		return site;
	}

	public static Map<String,Object> getProvinceById(String pid){
		for(Map<String,Object> map: getAll()){
			if(Objects.equals(map.get("pid"),pid)){
				return map;
			}
		}
		return null;
	}

	public static Map<String,Object> getProvinceByName(String pname){
		for(Map<String,Object> map: getAll()){
			if(Objects.equals(map.get("pname"),pname)){
				return map;
			}
		}
		return null;
	}

	public static Map<String,Object> getCityById(String cid){
		for(Map<String,Object> province: getAll()){
			for(Map<String,Object> city: (List<Map<String,Object>>)province.get("cs"))
				if(Objects.equals(city.get("cid"),cid)){
					province.putAll(city);
					return province;
				}
		}
		return null;
	}
	
	public static Map<String,Object> getCityByName(String cname){
		for(Map<String,Object> province: getAll()){
			for(Map<String,Object> city: (List<Map<String,Object>>)province.get("cs"))
				if(Objects.equals(city.get("cname"),cname)){
					province.putAll(city);
					return province;
				}
		}
		return null;
	}
	
//	public static void main(String [] args){
//		System.out.println(getAll());
//		System.out.println(getProvinceById("hl"));
//		System.out.println(getProvinceByName("湖北"));
//		System.out.println(getCityById("622700000400"));
//		System.out.println(getCityByName("平凉支队车管所"));
//	}
}
